a:7:{i:0;O:8:"stdClass":3:{s:7:"__title";s:75:"Nokia releases its mapping and navigation apps to all Windows Phone 8 users";s:9:"__content";s:1031:"
  


  




  You no longer need a Nokia-branded Windows Phone to run the company's various mapping and navigation apps. Today Nokia has opened up availability of Here Maps, Here Drive Beta, and Here Transit to all Windows Phone 8 devices in the US, Canada, UK, France, Germany, Italy, Mexico, and Spain. The three applications offer users more detailed location data (particularly in the case of turn-by-turn navigation) compared to Bing Maps, the default mapping software that ships on Windows Phone hardware. A Nokia Drive+ Beta first opened <a href="http://www.theverge.com/2013/1/23/3908416/nokia-drive-beta-now-available-for-all-windows-phone-8-devices">up to users late last month</a>, and the app remains in non-final form here. Even so, it (like Here Maps) provides niceties like offline map caching and customizable layers that show only the points of interest you're...
  
    <a href="http://www.theverge.com/2013/2/25/4027804/nokia-releases-mapping-navigation-apps-windows-phone-8">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:87:""http://cdn0.sbnation.com/entry_photo_images/7768495/nokiadrive3handson_640_large.jpg" ";}i:1;O:8:"stdClass":3:{s:7:"__title";s:87:"GM's LTE-enabled concept car streams live video, but hopefully not while you're driving";s:9:"__content";s:591:"
  


  




  GM brought a <a href="http://cadillac.com/ats" target="_blank">Cadillac ATS</a> to Mobile World Congress this week. This isn't a run-of-the-mill ATS, though &mdash; it's fitted with a number of LTE services billed as "concepts," meaning we may or may not see them when GM <a href="http://www.theverge.com/2013/2/25/4023868/gm-adding-at-t-lte-service-to-most-vehicles-starting-next-year">starts rolling out LTE on its production cars next year</a>.

  
    <a href="http://www.theverge.com/2013/2/25/4027374/gm-att-lte-car-hands-on-mwc-2013">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:89:""http://cdn1.sbnation.com/entry_photo_images/7768639/gm-att-lte-demo-003-1020_large.jpg" ";}i:2;O:8:"stdClass":3:{s:7:"__title";s:45:"Intel will finally power LTE phones this year";s:9:"__content";s:1220:"
  


  




  The first phone featuring Intel's next-generation Clover Trail+ Atom was unveiled <a href="http://www.theverge.com/2013/1/8/3853370/lenovos-5-5-inch-ideaphone-k900-dual-core-intel">over a month ago at CES</a>, but today the chip giant is finally ready to announce the details of the new processor, including optional support for LTE. Along with the expected CPU performance gains &mdash; the Clover Trail+ is the company's first dual-core processor for smartphones &mdash; Intel also claims the chip will has three times the graphical capabilities of its previous chip, which powered the <a href="http://www.theverge.com/2012/10/4/3447984/motorola-razr-i-review-intel-smartphone">mid-range Motorola Razr i smartphone</a>, as well as a number of carrier-branded devices such as the <a href="http://www.theverge.com/2012/6/14/3078078/orange-san-diego-intel-medfield-review">Orange San Diego</a>. It says its new graphics chip is more powerful than the GPU found in LG's Nexus 4 and Samsung's Galaxy S III. The big announcement, however, was LTE...
  
    <a href="http://www.theverge.com/2013/2/25/4027692/intel-clover-trail-plus-supports-lte-with-optional-xmm-7160-chip">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:79:""http://cdn0.sbnation.com/entry_photo_images/7768477/intellogo1_640_large.jpg" ";}i:3;O:8:"stdClass":3:{s:7:"__title";s:74:"'Next generation' Samsung smartphones to ship with Visa NFC payment system";s:9:"__content";s:913:"
  


  




  At an event today at MWC, Visa announced a partnership with Samsung that will result in its payWave mobile wallet app getting installed on the "next generation" of Samsung smartphones. PayWave will work with the NFC chip on those devices to enable mobile payments, but Visa says its agnostic about exactly which credit cards get used with the app. It's part of the "Visa Ready Program," which lets all sorts of companies connect to Visa's network of payment systems &mdash; instead of just banks, but manufacturers and carriers as well. In that vein, Visa says that its offering future Samsung customers the ability to hook up any Visa card to the secure NFC element in their smartphones for mobile payments.
PayWave is actually able to accomodate...
  
    <a href="http://www.theverge.com/2013/2/25/4027688/next-generation-samsung-smartphones-visa-nfc-payment">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:85:""http://cdn0.sbnation.com/entry_photo_images/7768043/visa-logo-stock_1020_large.jpg" ";}i:4;O:8:"stdClass":3:{s:7:"__title";s:47:"The mythology behind the mythology of Star Wars";s:9:"__content";s:876:"
  


  




  Star Wars' apparent influences range from spaghetti westerns to Kurosawa's samurai dramas &mdash; but the story may actually be a bit more mundane than George Lucas would have us believe. Lucas looked up to great auteurs like Kurosawa and writers like Tolkien, and when Lucas's own influences weren't as scholarly or profound as theirs, he spun a tale that made it seem that way. From Mexican revolutionaries to NASA, Michael Heilemann <a href="http://kitbashed.com/" target="_blank">breaks down Lucas's claims</a> to reveal a true background of science fiction pulps and films. Lucas's movie may have the thoughtful duels of a samurai flick, but chances are good that Luke's lightsaber only glows blue because it looks cool.
  
    <a href="http://www.theverge.com/culture/2013/2/25/4027302/the-real-influences-of-star-wars">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:73:""http://cdn2.sbnation.com/entry_photo_images/7764555/Z9cD0M1_large.jpeg" ";}i:5;O:8:"stdClass":3:{s:7:"__title";s:23:"Chromebook Pixel review";s:9:"__content";s:1011:"
  


  




  "Disposable." When Eric Schmidt and Google first introduced Chrome OS, its operating system designed for desktop and laptop PCs, <a href="http://techland.time.com/2010/04/20/eric-schmidt-chrome-os-devices-to-be-disposable-cost-under-400/">they kept using that word</a>. Schmidt promised cheap devices that were essentially interchangeable &mdash; when all the computing power, storage, and apps come from the internet, because the entire operating system is just a slightly modified version of the Chrome browser, why build good hardware? Google even claimed to be entertaining the idea of selling you a free-on-contract PC.

Well the times, they are a changin'. The latest Chromebook off the assembly line, the Chromebook Pixel, is the first designed by Google itself, and it's many things &mdash; but it's sure as hell not disposable. From the ultra-high-resolution...
  
    <a href="http://www.theverge.com/2013/2/25/4023830/google-chromebook-pixel-review">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:80:""http://cdn2.sbnation.com/entry_photo_images/7768343/chromebook-hero_large.jpg" ";}i:6;O:8:"stdClass":3:{s:7:"__title";s:97:"Internet providers launch controversial Copyright Alert System, promise 'education' over lawsuits";s:9:"__content";s:1269:"
  


  




  Five major internet service providers have signed onto a private sector effort to punish users for downloading copyrighted materials. Advocates say the new Copyright Alert System gives the entertainment industry a new tool to combat piracy, while opponents say it's a hassle for users that won't work to stop illegal downloading. The effort has been underway since 2011 but after suffering delays and <a href="http://www.theverge.com/2012/10/18/3521714/isp-copyright-alert-system-launch" target="_blank">missing its scheduled launch</a> in November, it is finally <a target="_blank" href="http://www.copyrightinformation.org/uncategorized/copyright-alert-system-set-to-begin/">being introduced today</a>.
The Copyright Alert System, also known as the "six strike" system, is a cooperation between ISPs and copyright owners such as movie studios and record companies. The conceit is that the system is <a href="https://torrentfreak.com/verizon-will-reduce-speeds-of-repeated-bittorrent-pirates-121115/" target="_blank">just "informing" users</a> that they are illegally trafficking content....
  
    <a href="http://www.theverge.com/2013/2/25/4026194/infamous-six-strike-anti-piracy-program-barks-harder-than-it-bites">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:81:""http://cdn3.sbnation.com/entry_photo_images/7768025/throttle_cropped_large.jpg" ";}}