a:7:{i:0;O:8:"stdClass":3:{s:7:"__title";s:63:"CBS considers producing original content for streaming services";s:9:"__content";s:1132:"
  


  




  CBS is thinking about creating original content for streaming video on demand services like Netflix, an executive told a group of investors today. Asked if he could see CBS producing a studio-caliber show along the lines of <a href="http://www.theverge.com/2013/2/12/3981996/house-of-cards-is-the-most-watched-thing-on-netflix-but-no-ones">Netflix's House of Cards</a>, Global Distribution Group CEO Armando Nu&ntilde;ez said, "it&rsquo;s definitely a possibility," adding, "we view Netflix, Amazon and all these SVOD platforms as new players. If you can get the right model to work, I can see us doing that." 
CBS was in early talks to resurrect 'Jericho' as a Netflix exclusive
Last year, reports surfaced that CBS was in early talks to <a href="http://www.tvguide.com/News/Exclusive-Netflix-Jericho-1046804.aspx" target="_blank">resurrect its popular action-drama, Jericho</a>, as a Netflix exclusive. The show developed a passionate following, but failed to get...
  
    <a href="http://www.theverge.com/2013/2/26/4034126/cbs-considers-original-content-for-streaming-services">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:84:""http://cdn3.sbnation.com/entry_photo_images/7775877/cbs-logo-stock_1020_large.jpg" ";}i:1;O:8:"stdClass":3:{s:7:"__title";s:68:"Alice Finch's Lego Hogwarts School will cast a bedazzling hex on you";s:9:"__content";s:1399:"
  


  




  You've probably seen<a href="http://www.theverge.com/2012/2/11/2790572/robotic-lego-prosthetic-arm-mindstorms"> plenty </a>of <a href="http://www.theverge.com/2012/4/15/2948121/star-wars-lego-organ-barrel-theme-music">impressive </a><a href="http://www.theverge.com/2012/3/18/2880768/lego-triport-spire-sci-fi-tim-goddard">Lego projects</a> surface <a href="http://www.theverge.com/2011/11/26/2587618/lego-christmas-tree-london-st-pancras">over the years</a>, but we're really blown away by this massive, intricate recreation of Harry Potter's Hogwarts School of Witchcraft and Wizardry. As reported <a target="_blank" href="http://www.brothers-brick.com/2013/02/26/alice-finch-builds-massive-lego-hogwarts-from-400000-bricks/">by The Brothers Brick</a>, Alice Finch's Lego Hogwarts debuted last year at BrickCon, but it's just been unveiled online in a breathtaking 75-photo gallery, complete with scene recreations from the Harry Potter series. As you can see in the photo above, the scale of the project is massive; Finch says she spent 12 months over an 18 month period to build the structure, using about 400,000 bricks in all. "I do not know how much it costs and I don't really want to know," Finch says. "I have ordered most of the tan [bricks] by the...
  
    <a href="http://www.theverge.com/2013/2/26/4033890/harry-potter-lego-hogwarts">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:88:""http://cdn1.sbnation.com/entry_photo_images/7775447/8508805311_0917cf70c0_b_large.jpg" ";}i:2;O:8:"stdClass":3:{s:7:"__title";s:80:"FAA denies reports that it will soon approve testing of Dreamliner battery fixes";s:9:"__content";s:1455:"
  


  




  The Federal Administration Aviation is disputing reports that it will soon approve testing of a set of battery fixes for the troubled 787 Dreamliner. Last week <a href="http://www.theverge.com/2013/2/20/4010244/boeing-reportedly-present-787-dreamliner-battery-fixes-to-faa-this-week">Boeing presented a number of proposed changes </a>to the FAA intended to address concerns with the plane's lithium-ion batteries. Today <a target="_blank" href="http://professional.wsj.com/article/SB10001424127887323699704578328710707378282.html?mod=googlenews_wsj&amp;mg=reno64-wsj">The Wall Street Journal reported</a> that the FAA would likely be giving the all-clear next week, with flights to follow sometime thereafter. However, FAA spokesperson Laura Brown has <a href="http://www.reuters.com/article/2013/02/27/us-faa-dreamliner-idUSBRE91Q00920130227" target="_blank">since told Reuters</a> that any claims to that effect are "completely inaccurate."
The FAA <a href="http://www.theverge.com/2013/1/16/3884428/faa-grounds-all-boeing-787-airplanes-after-second-battery-related-fire/in/3648825">grounded the troubled airplane in January</a> after a series of fires related to its lithium-ion batteries. The suite of fixes Boeing proposed are said to have included changes in the venting...
  
    <a href="http://www.theverge.com/2013/2/26/4033772/faa-may-approve-testing-of-787-dreamliner-battery-fixes-next-week">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:101:""http://cdn1.sbnation.com/entry_photo_images/7775289/Screen_Shot_2013-01-17_at_9.24.44_AM_large.png" ";}i:3;O:8:"stdClass":3:{s:7:"__title";s:82:"HP hedges against declining PC business, diverts some resources to tablet division";s:9:"__content";s:1010:"
  


  




  HP has made it clear it has <a href="http://www.theverge.com/2013/2/24/4024580/hp-building-multiple-tablets-this-year">some ambitious aspirations</a>, and at the Morgan Stanley Technology, Media &amp; Telecom Conference today, CEO Meg Whitman gave some insight on how the company is hoping to achieve those goals. Unsurprisingly, a large part of its approach is to address the company's former failures in mobile. "What happened is the market moved very fast to tablets and smartphones and now we've got to manage that transition," she said, noting that her predecessors did to try to address the shift by buying Palm. "But as you know, under the previous administration that took a little detour to nowhere."
As a result, HP has expanded the way it thinks about its computing business. "We now have the opportunity to compete in a...
  
    <a href="http://www.theverge.com/2013/2/26/4033422/hp-diverts-some-pc-resources-to-tablet-division-to-hedge-its-bets">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:77:""http://cdn1.sbnation.com/entry_photo_images/7774767/megwhitmanhp_large.jpg" ";}i:4;O:8:"stdClass":3:{s:7:"__title";s:28:"You can finally live in Ikea";s:9:"__content";s:923:"
  


  




  Ikea is making your dream of living in Ikea a reality. Inter Ikea Group, Ikea's parent company, is moving into urban development, and its first town is planned for south of Stratford, London. The half-billion dollar project isn't a new idea &mdash; planned communities and company towns already exist &mdash; but it's unclear what Ikea has to gain from the low-profit venture. The company is planning its town responsibly, with 15 percent of the apartments and family homes marked as affordably priced housing, and <a href="http://www.fastcompany.com/magazine/173/ikea-urban-planning" target="_blank">Fast Company questions</a> whether the town is a convoluted tax haven or a somewhat philanthropic effort. Either way, the good news is that it should all come preassembled.
  
    <a href="http://www.theverge.com/culture/2013/2/26/4033358/ikea-building-a-town-in-england">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:75:""http://cdn3.sbnation.com/entry_photo_images/7774873/ikeatv-11_large.jpeg" ";}i:5;O:8:"stdClass":3:{s:7:"__title";s:36:"New Jersey legalizes online gambling";s:9:"__content";s:1032:"
  


  




  Governor Chris Christie just signed a bill that will make online gambling legal in New Jersey, making his state the largest this far to allow the practice. The New Jersey state Senate and Assembly both approved a new version of the bill, which Christie submitted with changes after vetoing an earlier version, and Christie has now signed it into law. "This was a critical decision, and one that I did not make lightly," Governor Christie said in a statement <a href="http://online.wsj.com/article/SB10001424127887323884304578328293465612224.html" target="_blank">according to The Wall Street Journal</a>. "But with the proper regulatory framework and safeguards that I insisted on including in the bill, I am confident that we are offering a responsible yet exciting option that will make Atlantic City more competitive while also bringing financial...
  
    <a href="http://www.theverge.com/2013/2/26/4033534/governor-christie-signs-bill-legalizing-online-gambling-in-new-jersey">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:73:""http://cdn1.sbnation.com/entry_photo_images/7775001/DSC_0696_large.jpg" ";}i:6;O:8:"stdClass":3:{s:7:"__title";s:90:"90 Seconds on The Verge: Google+ Sign-In, PlayStation 4 downloads, and a moon named Vulcan";s:9:"__content";s:492:"
  


  




  Why, hello there! Come on in; take a look around. Right this way, keep moving, moving, moving. That's right, don't dawdle &mdash; and don't forget to stay with the group! We've got some surprises, and we wouldn't want you to miss them. We think you're going to like what you see. We have such sights to show you.

  
    <a href="http://www.theverge.com/2013/2/26/4032980/google-plus-sign-in-playstation-4-downloads-moon-named-vulcan-90sotv">Continue reading&hellip;</a>
  



";s:8:"__imgUrl";s:87:""http://cdn3.sbnation.com/entry_photo_images/7774853/NSV_161_130226_still_A_large.jpg" ";}}